<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<!-- DW6 -->
<head>
<!-- Copyright 2005 Macromedia, Inc. All rights reserved. -->
<title>Home Page</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<link rel="stylesheet" href="file:///C|/Users/USUARIO895/Documents/mm_travel2.css" type="text/css" />
<script language="JavaScript" type="text/javascript">
//--------------- LOCALIZEABLE GLOBALS ---------------
var d=new Date();
var monthname=new Array("January","February","March","April","May","June","July","August","September","October","November","December");
//Ensure correct for language. English is "January 1, 2004"
var TODAY = monthname[d.getMonth()] + " " + d.getDate() + ", " + d.getFullYear();
//---------------   END LOCALIZEABLE   ---------------
</script>
<style type="text/css">
<!--
.Estilo1 {font-family: Georgia, "Times New Roman", Times, serif}
.Estilo2 {
	font-family: Verdana, Arial, Helvetica, sans-serif;
	font-size: 36px;
}
.Estilo3 {font-size: 36px}
-->
</style>
</head>
<body bgcolor="#C0DFFD">
<table width="100%" border="0" cellpadding="0" cellspacing="0" bgcolor="#6600CC">
  <tr bgcolor="#3366CC">
    <td colspan="3" rowspan="2" bgcolor="#6600CC"><img src="descarga.png" width="836" height="265" /></td>
    <td height="63" colspan="3" align="center" valign="bottom" nowrap="nowrap" bgcolor="#6600CC" id="logo"><h4 class="Estilo2">BIBLIOGRAFIA DE LIT KILLAH </h4></td>
    <td width="4">&nbsp;</td>
  </tr>

  <tr bgcolor="#3366CC">
    <td height="64" colspan="3" align="center" valign="top" bgcolor="#6600CC" id="tagline"><img src="file:///C|/Users/USUARIO895/Downloads/images (1).jpg" width="1003" height="206" /></td>
	<td width="4">&nbsp;</td>
  </tr>

  <tr>
    <td colspan="7" bgcolor="#003366"><img src="file:///C|/Users/USUARIO895/Documents/mm_spacer.gif" alt="" width="1" height="1" border="0" /></td>
  </tr>

  <tr bgcolor="#CCFF99">
  	<td height="25" colspan="7" bgcolor="#000000" id="dateformat">&nbsp;&nbsp;
    <script language="JavaScript" type="text/javascript">
      document.write(TODAY);	</script></td>
  </tr>
 <tr>
    <td colspan="7" bgcolor="#003366"><img src="file:///C|/Users/USUARIO895/Documents/mm_spacer.gif" alt="" width="1" height="1" border="0" /></td>
  </tr>

 <tr>
    <td width="276" rowspan="2" valign="top" bgcolor="#6600CC">
	  <h3 align="center">Naci&oacute; el 4 de octubre de 1999, en Gonz&aacute;lez Cat&aacute;n,&nbsp;Partido de La Matanza,&nbsp;Argentina.2&#8203; Creci&oacute; en el seno de una familia humilde, de clase media. Su padre era trabajador en un frigor&iacute;fico y su madre cuidadora de ni&ntilde;os discapacitados.3&#8203; Desde chico fue admirador de los g&eacute;neros rap y hip hop, y de sus exponentes, como&nbsp;Eminem&nbsp;y&nbsp;50 cent.4&#8203; En su adolescencia se interes&oacute; por el rap y el&nbsp;Freestyle&nbsp;viendo diversos videos de estos encuentros en&nbsp;Internet. Algunos a&ntilde;os despu&eacute;s, a la edad de 16 a&ntilde;os, comenz&oacute; a frecuentar plazas locales cercanas donde se celebraban estos eventos. Posteriormente, en 2016, decidi&oacute; participar en la competencia de freestyle&nbsp;El Quinto Escal&oacute;n.5&#8203; Monz&oacute;n eligi&oacute; su nombre art&iacute;stico&nbsp;Lit Killah&nbsp;casi aleatoriamente al idearlo en base a una b&uacute;squeda por&nbsp;Google. &quot;Lit&quot; en ingl&eacute;s significa &quot;encender&quot;, pero tambi&eacute;n son aplicables las traducciones &quot;prender&quot; o &quot;iluminar&quot;, por otra parte &quot;Killah&quot; es solo una palabra para darle estilo a su nombre, seg&uacute;n declar&oacute;.6&#8203; En una entrevista afirma que su intenci&oacute;n a la hora de escoger su nombre era que el mismo no fuera &quot;tecniqueable&quot; (es decir, que no pudiesen hacer juegos de palabras con su nombre) por sus rivales en las batallas de freestyle.7&#8203; Tambi&eacute;n, entre los fanes, se le han dado diferentes apodos, como &quot;Dam Sin Pila&quot;, &quot;Ametralladora&quot; y &quot;Modo Tomate&quot;, estos &uacute;ltimos por la rapidez al improvisar, sobre todo cuando no toma suficiente aire y su cara se pone rojiza por el esfuerzo.</h3>
 	  <div align="center"> <br />
 	    &nbsp;<br />
 	    <img src="../Downloads/1281223dd3e5d4b035dc2ca8775a4cfa91e20508.jpg" width="195" height="204" />&nbsp;<br />
 	    &nbsp;<br /> 	
      </div>
 	  <h2 align="center">Canciones destacadas</h2>
 	  <p>Aqu&iacute; te mostramos una lista de 15 canciones destacadas de Lit Killah que deber&iacute;as escuchar para conocer a la artista.</p>
 	  <ol>
 	    <li><strong>Flexin&rsquo;</strong>&nbsp;con Bizarrap</li>
 	    <li><strong>Buf&oacute;n</strong></li>
 	    <li><strong>Apaga el celular</strong></li>
 	    <li><strong>DE$TROY</strong></li>
 	    <li><strong>Adem&aacute;s de m&iacute; (Remix)</strong>&nbsp;con Rusherking, Tiago PZK, KHEA, Duki y Maria Becerra</li>
 	    <li><strong>Tan Bien</strong>&nbsp;con Agus Padilla</li>
 	    <li><strong>Si Te Vas</strong></li>
 	    <li><strong>Entre Nosotros</strong>&nbsp;con Tiago PZK</li>
 	    <li><strong>Se Termin&oacute;</strong>&nbsp;con K&oacute;digo</li>
 	    <li><strong>California</strong></li>
 	    <li><strong>Yo s&eacute; que t&uacute;</strong>&nbsp;con FMK, Tiago PZK y Rusherking</li>
 	    <li><strong>Parte de m&iacute;</strong>&nbsp;con FMK</li>
 	    <li><strong>Amor Ciego</strong></li>
 	    <li><strong>Te Sigo</strong>&nbsp;con Randy &laquo;Nota Loca&raquo;</li>
 	    <li><strong>Cerca de ti (Remix)</strong>&nbsp;con Tiago PZK, Rusherking, Seven Kayne, Bhavi y Tobi</li>
      </ol>
 	  <p>&nbsp;</p>
 	  <p>&nbsp;</p></td>
    <td width="350" bgcolor="#6600CC"><div align="center">Monz&oacute;n fue part&iacute;cipe de la competencia de plaza de Argentina:&nbsp;El Quinto Escal&oacute;n. All&iacute; estuvo por primera vez en abril de 2016. Sin embargo, fue en&nbsp;<em>El Campito Free</em>, competencia de plaza en&nbsp;Ramos Mej&iacute;a, donde su nombre salt&oacute; r&aacute;pidamente a la fama. En agosto de ese a&ntilde;o se coron&oacute; como el ganador de ese evento y fue en la batalla contra&nbsp;Duki, por semifinales, lo que hizo que su talento se haga viral en todas las redes sociales. En lo que fue un batall&oacute;n, en el 4&times;4 final, una rima de Lit Killah haciendo un juego de palabras con &ldquo;parabrisas&rdquo; lo catalog&oacute; a la fama. </div>
      <p align="center">Desde all&iacute;, su nombre como freestyler se fue enalteciendo. Particip&oacute; activamente de&nbsp;<em>El Quinto Escal&oacute;n</em>&nbsp;y de distintas competencias nacionales. Se destac&oacute; por su doble tempo, pero sobre todo por la capacidad de rimar a una velocidad alta, haci&eacute;ndolo con coherencia, jugando a estructurar las palabras y rematando con un punchline certero.</p>
    <p align="center">Si bien siempre tuvo nivel, el freestyler nunca se consagr&oacute; en plaza en&nbsp;<em>El Quinto Escal&oacute;n</em>. Fue reci&eacute;n cuando la competencia pas&oacute; a escenario donde &eacute;l pudo coronarse como campe&oacute;n. Por la fecha 6 del torneo en 2017, lleg&oacute; a la final y le gan&oacute; a Replik. Una semana despu&eacute;s, por la fecha 7, volvi&oacute; a repetir la haza&ntilde;a gan&aacute;ndole en la final a Dani. Ya para finales de ese a&ntilde;o, estaba en Lit Killah la idea de muchos freestylers en ese momento: dejar las batallas para dedicarse a la m&uacute;sica. Y fue a principios de a&ntilde;o de 2018, donde &eacute;l se mostr&oacute; batallando por &uacute;ltima vez: fue en una gira por&nbsp;Espa&ntilde;a&nbsp;que hizo con Ecko, donde se enfrentaron en dupla BTA y Zasko vs. Blon y Force</p>       
    <div align="center"><img src="file:///C|/Users/USUARIO895/Downloads/descarga (3).jpg" width="241" height="233" /></div></td>
    <td colspan="2" rowspan="2" valign="top" bgcolor="#6600CC"><div align="center"><img src="file:///C|/Users/USUARIO895/Documents/mm_spacer.gif" alt="" width="305" height="1" border="0" /><br />
      &nbsp;<br />
      &nbsp;<span id="2017-2018:_Inicios_musicales">2017-2018: Inicios musicales</span>[editar] </div>
      <p align="center">En octubre de 2017, y coincidiendo con su cumplea&ntilde;os, public&oacute; su primer sencillo titulado &laquo;De$troy&raquo;, una producci&oacute;n fiel a su estilo demostrado en sus encuentros previos en las batallas de freestyle. En noviembre de ese mismo a&ntilde;o, con 17 a&ntilde;os, firm&oacute; contrato con la discogr&aacute;fica&nbsp;Warner Music Argentina.13&#8203;</p>
	<p align="center">En enero de 2018, present&oacute; &laquo;Apaga el celular&raquo;, una canci&oacute;n de subg&eacute;nero trap, cuya letra refleja el arrepentimiento y tristeza de quien no supo apreciar el amor de su pareja.14&#8203; En junio public&oacute; una nueva canci&oacute;n, titulada &laquo;Buf&oacute;n&raquo;.15&#8203; En agosto lanz&oacute; una nueva canci&oacute;n, &laquo;Si te vas&raquo;, producida por Dj Tao, que transita por el&nbsp;<em>future trap</em>&nbsp;junto a una base de&nbsp;m&uacute;sica electr&oacute;nica.16&#8203; En noviembre de ese mismo a&ntilde;o, public&oacute; una nueva canci&oacute;n y video titulado &laquo;Tan bien&raquo;, en colaboraci&oacute;n con la cantante uruguaya&nbsp;Agus Padilla.17&#8203; En diciembre, particip&oacute; de la tercera session del productor argentino&nbsp;Bizarrap,&nbsp;<em>&laquo;Lit Killah: Bzrp Freestyle Sessions, Vol. 3&raquo;</em></p>
	<p align="center"><img src="../Downloads/4981e03a01d1ed5f9bd86afc238f97a6.jpg" width="736" height="920" /></p>
	<br />
    <br />
    <p>&nbsp;</p>
    <p>&nbsp;</p>
    <p align="center" class="Estilo3">2019-2020: Nueva m&uacute;sica y colaboraciones</p>
    <p>El 18 de enero de 2019, particip&oacute; del sencillo &laquo;Bendito&raquo; del  rapero mexicano Hadrian, en el cual tambi&eacute;n figura como invitado el productor  brasile&ntilde;o Papatinho.18&#8203; Al mes siguiente, colabora con FMK en su nuevo sencillo  &laquo;Parte de m&iacute;&raquo;. La canci&oacute;n producida por Big One combina elementos  del&nbsp;R&amp;B&nbsp;y el trap. El videoclip retrata por un lado una juntada  de amigos despu&eacute;s de una noche de fiesta y, por otro lado, una situaci&oacute;n  abstracta de un amor perdido.19&#8203; Este sencillo fue certificado oro por&nbsp;C&aacute;mara  Argentina de Productores de Fonogramas y Videogramas.20&#8203; En abril lanz&oacute;  &laquo;Eclipse&raquo;, una canci&oacute;n de desamor donde se lamenta y le pide perd&oacute;n a una mujer  por no valorarla. El mismo fue presentado en el&nbsp;planetario Galileo  Galilei, en d&oacute;nde se present&oacute; interpretando &eacute;ste y otros temas de su  repertorio.21&#8203;</p>
    <p>En junio se uni&oacute; a los artistas JD Pantoja, Dayme &amp; El  High y&nbsp;Rauw Alejandro&nbsp;en el lanzamiento del sencillo &laquo;Aroma&raquo;,22&#8203; y en  julio, particip&oacute; del remix de &laquo;Sed&uacute;ceme&raquo; del cantante Guelo Star, junto a Rafa  Pab&ouml;n y Lyanno con Juanka, Brray, Anonimus, Dylan Fuentes, KRh, Neo Pistea y  Kodeina.23&#8203; En agosto el rapero public&oacute; &laquo;Amor ciego&raquo;, compuesto  en&nbsp;Medell&iacute;n&nbsp;junto a Cheztom.24&#8203; En octubre lanz&oacute; &laquo;Samur&aacute;i&raquo;, en  colaboraci&oacute;n con el rapero y freestyler venezolano&nbsp;Big Soto, acompa&ntilde;a de  un videoclip d&oacute;nde cuenta una historia que mezcla el skate, lo urbano y la  cultura japonesa, incluyendo las artes marciales, la lucha de sumo y las  armaduras samur&aacute;i.25&#8203;</p>
    <p>En febrero de 2020, present&oacute; con un video en YouTube un  nuevo tema, &laquo;Wake me&raquo;.26&#8203; El 28 del mismo mes, se uni&oacute; con EZ El Ezeta y &Ntilde;ejo  en el lanzamiento de &laquo;Flow miami&raquo;. En marzo present&oacute; &laquo;Te sigo&raquo;, canci&oacute;n en la  que participa el cantante&nbsp;Randy.27&#8203; En junio lanz&oacute; &laquo;Flexin&raquo;, una canci&oacute;n  producida por el productor argentino&nbsp;Bizarrap.28&#8203; La canci&oacute;n fue  certificada como disco de platino en Argentina y oro en M&eacute;xico. En septiembre,  present&oacute; &laquo;Se termin&oacute;&raquo; en colaboraci&oacute;n con Kodigo.29&#8203; En octubre se uni&oacute; al  lanzamiento del tema &laquo;Cerca de ti (Remix)&raquo;, originalmente de&nbsp;Tiago  Pzk&nbsp;y&nbsp;Rusherking, junto a Bhavi, Tobi y Seven Kayne.30&#8203;</p>
    <p>&nbsp;</p>
    <p align="center" class="Estilo3">Desde 2021:&nbsp;MAWZ</p>
    <p>En febrero de 2021, public&oacute; &laquo;Change&raquo;, tema que marca un  estilo &quot;rapper&quot; y en su letra habla de los cambios que vivi&oacute; desde su  pasado m&aacute;s humilde hasta llegar a posicionarse en la industria de la m&uacute;sica, y  mejorar la vida de su familia.31&#8203; Al mes siguiente, colabor&oacute; con  Rusherking,&nbsp;Khea,&nbsp;Duki, Tiago PZK y&nbsp;Mar&iacute;a Becerra&nbsp;en el  sencillo &laquo;Adem&aacute;s de m&iacute; (Remix)&raquo;.32&#8203; La canci&oacute;n alcanz&oacute; el primer puesto  en&nbsp;Argentina Hot 100&nbsp;de&nbsp;Billboard&nbsp;y fue certificada platino  en el pa&iacute;s.33&#8203; En mayo particip&oacute; del lanzamiento de &laquo;Yo se que t&uacute;&raquo;, canci&oacute;n de  FMK interpretada junto a Tiago PZK y Rusherking, tema que fusiona sonidos de  trap y reggeat&oacute;n.34&#8203; En junio lanz&oacute; &laquo;California&raquo;, el segundo sencillo de su  &aacute;lbum debut, producido por Oniria.35&#8203; Al mes siguiente, se asoci&oacute; con Tiago PZK  en el sencillo &laquo;Entre nosotros&raquo;.36&#8203; La canci&oacute;n alcanz&oacute; la cima de Argentina Hot  100 de Billboard y fue el segundo primer puesto del cantante en la lista.37&#8203;  Particip&oacute; del tema &laquo;Nat geo (Remix)&raquo;, originalmente de Falke 912, junto a  Bhavi.38&#8203;</p>
    <p>El 19 de agosto de 2021, lanz&oacute; su primer &aacute;lbum&nbsp;MAWZ, y  dos horas despu&eacute;s de la presentaci&oacute;n del mismo public&oacute; el tercer&nbsp;single,  &laquo;Dejame tranki&raquo;, en el que participa el cantante argentino&nbsp;Khea.39&#8203;</p>
    <h2 align="center" class="Estilo3">Curiosidades de Lit Killah</h2>
    <ul>
      <li>La canci&oacute;n m&aacute;s escuchada totalmente de su autor&iacute;a es &laquo;Flexin'&raquo; (+110M en Youtube), mientras que la m&aacute;s escuchada en la que colabora es &laquo;Adem&aacute;s de M&iacute; Remix&raquo; (+150M en Youtube).</li>
    </ul>
    <ul>
      <li>Tiene su propio videojuego para dispositivos m&oacute;viles llamado &laquo;LIT killah: The Game&raquo; el cual fue lanzado en abril de 2020.</li>
    </ul>
    <ul>
      <li>La primera competici&oacute;n que gan&oacute; fue en 2017 en la octava edici&oacute;n de El Campito Free contra Beelze.</li>
    </ul>
    <ul>
      <li>Su batalla de freestyle con m&aacute;s reproducciones se titula &laquo;Afrito vs Lit Killah vs Mamba vs Chiki&raquo; llevada a cabo el 2016 en El Quinto Escal&oacute;n.</li>
      <li>Su tema debut se titula &laquo;DE$TROY&raquo; y su fecha de lanzamiento (el 4 de octubre de 2017) coincide con el cumplea&ntilde;os n&uacute;mero 18 de Lit Killah.</li>
    </ul>    
    <ul>
      <li>Apenas un mes despu&eacute;s de haber lanzado su primer single, en noviembre de 2017 firma un contrato con Warner Music Argentina.</li>
    </ul>
    <div>
      <ul>
        <li>Fue uno de los primeros raperos en colaborar con el productor Bizarrap, llegando a colaborar en la BZRP Freestyle Session #3.</li>
      </ul>
      <ul>
        <li>Se espera que su &aacute;lbum debut sea lanzado en 2021, 4 a&ntilde;os despu&eacute;s de haber lanzado su primer sencillo.</li>
      </ul>
      <ul>
        <li>Algunos de los apodos que le pusieron los fans fueron &laquo;Metralleta&raquo; y &laquo;Modo Tomate&raquo; debido a la rapidez y a lo rojo que este se pon&iacute;a al hacer su doble tempo y quedarse sin aire.</li>
      </ul>
      <ul>
        <li>Lit Killah no es ajeno al mundo del streaming y de hecho tiene su propio canal en Twitch que acumula casi 2 millones de suscriptores.</li>
      </ul>
    </div>
    <div data-location="bottom" data-type="type-1">
      <div data-icons-type="simple"></div>
    </div>
    <p class="Estilo3"><img src="../Downloads/lit-killah_1440x810_wmk.jpg" width="724" height="494" /></p>    </td>
    <td width="50" rowspan="2"><img src="file:///C|/Users/USUARIO895/Documents/mm_spacer.gif" alt="" width="50" height="1" border="0" /></td>
        <td width="351" rowspan="2" valign="top"><br />
		&nbsp;<br />
		<table border="0" cellspacing="0" cellpadding="0" width="190">
			<tr>
			<td colspan="3" class="subHeader" align="center"><div align="center" class="Estilo1">discografia</div></td>
			</tr>

			<tr>
			<td width="40">&nbsp;</td>
			<td width="110" id="sidebar" class="smallText"><h3><span id="MAWZ"><strong>MAWZ</strong></span></h3>
			  <ul>
			    <li><em>Dejame Tranki ft. KHEA</em></li>
			    <li><em>CALIFORNIA</em></li>
			    <li><em>En La Oscuridad ft. Maria Becerra</em></li>
			    <li><em>My Bag</em></li>
			    <li><em>Mala M&iacute;a ft. Duki</em></li>
			    <li><em>A Tus Pies ft. Rusherking</em></li>
			    <li><em>No Hables Mal De M&iacute;</em></li>
			    <li><em>Ese Mensaje ft. FMK</em></li>
			    <li><em>S&eacute; Que No Te Gusta Estar So</em></li>
			    <li><em>Dame Una Nite ft. Tiago PZK</em></li>
			    <li><em>El Inversor</em></li>
			    <li><em>Hechizame</em></li>
			    <li><em>CHANGE</em></li>
			    <li><em>Soy Uno M&aacute;s</em></li>
		      </ul>
			  <br />
			<p><img src="file:///C|/Users/USUARIO895/Downloads/descarga (4).jpg" width="225" height="225" /><br />
			  <span dir="auto"> </span><a spellcheck="false" href="https://www.youtube.com/redirect?event=video_description&amp;redir_token=QUFFLUhqbmdWRVgzWU5LOFozdjc5ekNNYlRBbE9zVEg0UXxBQ3Jtc0tuYjQtdG5vUFhUYlpNR1l2alEtbDFiMjZtTW56Z3MxUWNYc2dwRHduR3B6bHR5eWd3emRqM1ZibE9WaWltVWpNWV9IOGNlZWszSnZwSjBoaG5PYTBoUDhuSjNVbllFcGZWRi1hOU13Umt5ekdhdjlzYw&amp;q=https%3A%2F%2FLitKillah.lnk.to%2FMAWZ&amp;v=hOXrGqq07_U" rel="nofollow" target="_blank" dir="auto">https://LitKillah.lnk.to/MAWZ</a>			</p>
			<p>&nbsp;</p>
			<p><img src="file:///C|/Users/USUARIO895/Downloads/images.jpg" width="225" height="225" /><img src="file:///C|/Users/USUARIO895/Documents/mm_spacer.gif" alt="" width="40" height="1" border="0" /><br />
&nbsp;https://www.youtube.com/watch?v=_3DS5D20ZyA</p>
			<p>			<br />			
			  </p>
			<p>&nbsp;</p>
			<p>&nbsp;</p>
			<p>&nbsp;</p>
			<p>&nbsp;</p>
			<p>&nbsp;</p>
			<p>&nbsp;</p>
			<p>&nbsp;</p>
			<p>&nbsp;</p>
			<p>&nbsp;</p></td>
			<td width="40">&nbsp;</td>
			</tr>
		</table>	</td>
	<td width="4" rowspan="2">&nbsp;</td>
  </tr>
 <tr>
   <td height="283" bgcolor="#6600CC"><p align="center" class="Estilo3">&nbsp;</p>
     <p align="center" class="Estilo3">&iquest;Qu&eacute; significa lit Killah?</p>
     <p align="center">&quot;Fue de apurado... porque cuando me anot&eacute; en las  batallas, todos tienen apodo y yo no ten&iacute;a ninguno. Empec&eacute; a buscar palabras y  encontr&eacute; &quot;LIT&quot;: corta, de tres  letras,&nbsp;significa&nbsp;'encendido', y me sent&iacute; representado; y  &quot;Killah&quot; es un agregado para darle estilo. En la jerga  yanqui,&nbsp;significa&nbsp;asesino</p>
     <p align="center">&nbsp;</p>
    <p align="center">&nbsp;</p>
    <h2 align="center">Datos personales de Lit Killah</h2>
    <table border="20">
      <tbody>
        <tr>
          <td><strong>Nombre art&iacute;stico</strong></td>
          <td>Lit Killah</td>
        </tr>
        <tr>
          <td><strong>Nombre real</strong></td>
          <td>Mauro Rom&aacute;n Monz&oacute;n</td>
        </tr>
        <tr>
          <td><strong>Nacimiento</strong></td>
          <td>4 Octubre, 1999 (Gonz&aacute;lez Cat&aacute;n, Buenos Aires, Argentina)</td>
        </tr>
        <tr>
          <td><strong>Edad</strong></td>
          <td>22 a&ntilde;os</td>
        </tr>
        <tr>
          <td><strong>Nacionalidad</strong></td>
          <td>argentino</td>
        </tr>
        <tr>
          <td><strong>Altura</strong></td>
          <td>1.80 metros aprox.</td>
        </tr>
        <tr>
          <td><strong>Ocupaci&oacute;n</strong></td>
          <td>rapero, m&uacute;sico; freestyler; streamer</td>
        </tr>
        <tr>
          <td><strong>Instrumentos</strong></td>
          <td>voz</td>
        </tr>
        <tr>
          <td><strong>G&eacute;neros musicales principales</strong></td>
          <td>rap, trap, reggaet&oacute;n</td>
        </tr>
        <tr>
          <td><strong>Actividad</strong></td>
          <td>2016 &ndash; presente</td>
        </tr>
        <tr>
          <td><strong>Idiomas</strong></td>
          <td>espa&ntilde;ol</td>
        </tr>
      </tbody>
    </table>
    <p align="center">&nbsp;</p>
    <p>El 14 de agosto de ese a&ntilde;o sali&oacute; campe&oacute;n en &ldquo;El Campito Free VIII&rdquo;, que se realiza en el Parque Sarmiento de Ramos Mej&iacute;a, provincia de Buenos Aires, en una final contra Beelze. En esa competencia, sus punchlines tuvieron mucha repercusi&oacute;n, en especial la que lanz&oacute; contra&nbsp;<a href="https://www.cmtv.com.ar/biografia/show.php?bnid=2506&amp;banda=Duki">Duki</a>, utilizando la palabra &ldquo;brisa&rdquo;, usada por su rival en el acote anterior.<br />
        <br />
      En 2017 tuvo un muy buen desempe&ntilde;o, ganando dos fechas consecutivas en El Quinto Escal&oacute;n. Y la fama ya empezaba a sentirse. En una de las fechas lo rodearon cientos de fans y se arm&oacute; una ronda que no lo dej&oacute; salir por casi dos horas, pidiendo fotos y queriendo estar cerca de su &iacute;dolo. El 4 de octubre de ese a&ntilde;o Lit Killah lanza su primer tema llamado&nbsp;<a href="https://www.cmtv.com.ar/discos_letras/letra.php?bnid=2500&amp;banda=Lit_Killah&amp;DS_DS=11958&amp;tmid=142633&amp;tema=DE$TROY" target="_blank">&quot;De$troy&quot;</a>.<br />
      <br />
      El 23 de enero de 2018 edita su single, titulado&nbsp;<a href="https://www.cmtv.com.ar/discos_letras/letra.php?bnid=2500&amp;banda=Lit_Killah&amp;DS_DS=11913&amp;tmid=142449&amp;tema=APAGA_EL_CELULAR" target="_blank">&ldquo;Apaga el Celular&rdquo;</a>. El 8 de junio estrena&nbsp;<a href="https://www.cmtv.com.ar/discos_letras/letra.php?bnid=2500&amp;banda=Lit_Killah&amp;DS_DS=12091&amp;tmid=143204&amp;tema=BUF%D3N" target="_blank">&quot;Buf&oacute;n&quot;</a>. El 30 de agosto sale&nbsp;<a href="https://www.cmtv.com.ar/discos_letras/letra.php?bnid=2500&amp;banda=Lit_Killah&amp;DS_DS=12271&amp;tmid=144220&amp;tema=SI_TE_VAS" target="_blank">&quot;Si Te Vas&quot;</a>. El 29 de noviembre sale&nbsp;<a href="https://www.cmtv.com.ar/discos_letras/letra.php?bnid=2500&amp;banda=Lit_Killah&amp;DS_DS=12525&amp;tmid=145548&amp;tema=TAN_BIEN_(FT._AGUS_PADILLA)" target="_blank">&quot;Tan Bien&quot;</a>, una de las mejores canciones de<a href="https://www.cmtv.com.ar/biografia/show.php?bnid=2500" target="_blank">&nbsp;Lit Killah</a>, en la que colabora Agus Padilla. El 29 de diciembre lanza junto a&nbsp;<a href="https://www.cmtv.com.ar/biografia/show.php?bnid=2610&amp;banda=Bizarrap_(BZRP)" target="_blank">Bizarrap</a>:&nbsp;<a href="https://www.cmtv.com.ar/discos_letras/letra.php?bnid=2500&amp;banda=Lit_Killah&amp;DS_DS=13523&amp;tmid=149481&amp;tema=LIT_KILLAH_-_BZRP_FREESTYLE_SESSION_#3" target="_blank">BZRP FREESTYLE SESSION #3</a>.</p>
    <p>El 25 de abril de 2019 lanza el video de&nbsp;<a href="https://www.cmtv.com.ar/discos_letras/letra.php?bnid=2500&amp;banda=Lit_Killah&amp;DS_DS=14101&amp;tmid=151809&amp;tema=ECLIPSE" target="_blank">&quot;Eclipse&quot;</a>. El 29 de agosto lanza el sencillo y video&nbsp;<a href="https://www.cmtv.com.ar/discos_letras/letra.php?bnid=2500&amp;banda=Lit_Killah&amp;DS_DS=12945&amp;tmid=147199&amp;tema=AMOR_CIEGO" target="_blank">&quot;Amor Ciego&quot;</a>&nbsp;y el 31 de octubre&nbsp;<a href="https://www.cmtv.com.ar/discos_letras/letra.php?bnid=2500&amp;banda=Lit_Killah&amp;DS_DS=13012&amp;tmid=147404&amp;tema=SAMURAI_(FT._BIG_SOTO)" target="_blank">&quot;Samurai&quot;</a>&nbsp;con la colaboraci&oacute;n de Big Soto.<br />
        <br />
      El 7 de febrero de 2020&nbsp;<a href="https://www.cmtv.com.ar/biografia/show.php?bnid=2500" target="_blank">Lit Killah</a>&nbsp;presenta su nueva canci&oacute;n y video de&nbsp;<a href="https://www.cmtv.com.ar/discos_letras/letra.php?bnid=2500&amp;banda=Lit_Killah&amp;DS_DS=13152&amp;tmid=147768&amp;tema=WAKE_ME" target="_blank">&quot;Wake Me&quot;</a>. El 1 de marzo de 2020 edita la canci&oacute;n&nbsp;<a href="https://www.cmtv.com.ar/discos_letras/letra.php?bnid=2500&amp;banda=Lit_Killah&amp;DS_DS=13524&amp;tmid=149482&amp;tema=TE_SIGO_(Ft._RANDY)_" target="_blank">&quot;Te sigo&quot;</a>&nbsp;con la colaboraci&oacute;n del artista puertorrique&ntilde;o Randy<em>.</em>&nbsp;El 25 de junio estrena el video y sencillo de&nbsp;<a href="https://www.cmtv.com.ar/discos_letras/letra.php?bnid=2500&amp;banda=Lit_Killah&amp;DS_DS=13935&amp;tmid=151098&amp;tema=FLEXIN%92_(FT._BIZARRAP)" target="_blank">&quot;Flexin&rsquo;&quot;</a>&nbsp;junto a&nbsp;<a href="https://www.cmtv.com.ar/biografia/show.php?bnid=2610&amp;banda=Bizarrap_(BZRP)" target="_blank">Bizarrap</a>. A finales de septiembre presenta su nueva canci&oacute;n, titulada&nbsp;<a href="https://www.cmtv.com.ar/discos_letras/letra.php?bnid=2500&amp;banda=Lit_Killah&amp;DS_DS=14547&amp;tmid=153269&amp;tema=SE_TERMIN%D3_(FT._KODIGO)" target="_blank">&quot;Se Termin&oacute;&quot;,</a>&nbsp;que cont&oacute; con la participaci&oacute;n de su amigo, colega y una de las grandes figuras del freestyle hispanoparlante:&nbsp;<a href="https://www.cmtv.com.ar/biografia/show.php?bnid=2507&amp;banda=Kodigo" target="_blank">Kodigo.</a></p>
    <p>El 13 de mayo del 2021 participa junto a<a href="https://www.cmtv.com.ar/biografia/show.php?bnid=2715&amp;banda=Tiago_PZK" target="_blank">&nbsp;Tiago PZK</a>, y Rusherking en el nuevo single y video&nbsp;<a href="https://www.cmtv.com.ar/discos_letras/show.php?bnid=2500&amp;banda=Lit_Killah" target="_blank">&ldquo;Yo se que tu&quot;</a>&nbsp;de<a href="https://www.cmtv.com.ar/biografia/show.php?bnid=2535&amp;banda=FMK" target="_blank">&nbsp;FMK.</a></p>
    <p>El 19 de agosto de 2021 lanza su &aacute;lbum &ldquo;<a href="https://www.cmtv.com.ar/discos_letras/show.php?bnid=2500&amp;banda=Lit_Killah" target="_blank">Mawz</a>&ldquo;.</p>
    <p>El 11 de noviembre estrena el videoclip de &quot;<a href="https://www.cmtv.com.ar/discos_letras/letra.php?bnid=2500&amp;banda=Lit_Killah&amp;DS_DS=17724&amp;tmid=165580&amp;tema=MALA_MIA_(FEET_DUKI)" target="_blank">Mala M&iacute;a</a>&quot; en feat con&nbsp;<a href="https://www.cmtv.com.ar/biografia/show.php?bnid=2506&amp;banda=Duki" target="_blank">Duki</a>.&nbsp;</p>
    <p>El 13 de enero de 2022 lanza el single y videoclip &quot;<a href="https://www.cmtv.com.ar/discos_letras/letra.php?bnid=2545&amp;banda=Bhavi&amp;DS_DS=18702&amp;tmid=168740&amp;tema=AYER_(FT._LIT_KILLAH)_" target="_blank">Ayer</a>&quot; junto a&nbsp;<a href="https://www.cmtv.com.ar/biografia/show.php?bnid=2545&amp;banda=Bhavi" target="_blank">Bhavi</a>.</p>
    <p>El 7 de abril lanza &quot;<a href="https://www.cmtv.com.ar/discos_letras/letra.php?bnid=2500&amp;banda=Lit_Killah&amp;DS_DS=19263&amp;tmid=170333&amp;tema=KU%B4_(FT._DE_LA_GHETTO_/_L-GANTE)" target="_blank">Ku`</a>&quot; junto a&nbsp;<a href="https://www.cmtv.com.ar/biografia/show.php?bnid=2896&amp;banda=L_GANTE" target="_blank">L Gante</a>&nbsp;y&nbsp;<a href="https://www.cmtv.com.ar/biografia/show.php?bnid=2425&amp;banda=De_La_Ghetto" target="_blank">De La Ghetto</a>.&nbsp;</p>
    <p>El 14 de abril de 2022 lanza &quot;<a href="https://www.cmtv.com.ar/discos_letras/letra.php?bnid=2500&amp;banda=Lit_Killah&amp;DS_DS=19279&amp;tmid=170348&amp;tema=DE_LAO_A_LAO_(FT._DJ_TAO_/_LIT_KILLAH_/_ALAN_GOM%C9Z_/_OMY_DE_ORO_/_JAVIIELO)_-_TURREO_SESSIONS_#5_(REMIX)" target="_blank">De lao a lao: Turreo Sessions # 5 (Remix)</a>&quot; junto a DJ Tao,&nbsp;<a href="https://www.cmtv.com.ar/biografia/show.php?bnid=2986&amp;banda=Kaleb_Di_Masi" target="_blank">Kaleb Di Masi</a>, Omy de Oro, Alan Gomez, Javiielo y Dime Ecua.</p>
    <div id="c-tres"></div>
    <br />
    <p align="center"><img src="../Downloads/68747470733a2f2f73332e616d617a6f6e6177732e636f6d2f776174747061642d6d656469612d736572766963652f53746f7279496d6167652f71616261376571423474743830773d3d2d36332e31353739333032363138343335383835333134303134393138323.jpg" width="720" height="703" /></p>
    <p align="center">&nbsp;</p>
    <p align="center">&nbsp;</p>
    <p align="center">&nbsp;</p>
    <p align="center">&nbsp;</p>
    <p align="center">&nbsp;</p>
    <p align="center">&nbsp;</p>
    <p align="center">&nbsp;</p>
    <p align="center">&nbsp;</p>
    <p align="center">&nbsp;</p>
    <p align="center">&nbsp;</p>
    <p align="center">&nbsp;</p>
    <p align="center">&nbsp;</p>
    <p align="center">&nbsp;</p>
    <p align="center">&nbsp;</p>
    <p align="center">&nbsp;</p>
    <p align="center">&nbsp;</p>
    <p align="center">&nbsp;</p>
    <p align="center">&nbsp;</p>
    <p align="center">&nbsp;</p>
    <p align="center">&nbsp;</p>
    <p align="center">&nbsp;</p>
    <p align="center">&nbsp;</p></td>
 </tr>
  <tr>
    <td width="276" bgcolor="#000000">&nbsp;</td>
    <td width="350" bgcolor="#000000">&nbsp;</td>
    <td width="210" bgcolor="#000000">&nbsp;</td>
    <td width="626" bgcolor="#000000">&nbsp;</td>
    <td width="50">&nbsp;</td>
    <td width="351">&nbsp;</td>
	<td width="4">&nbsp;</td>
  </tr>
</table>
</body>
</html>
